tap "arkweid/lefthook"
tap "browsh-org/browsh"
tap "buildkite/buildkite"
tap "buildkite/cli"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "itchyny/tap"
tap "jason0x43/neovim-nightly"
tap "jesseduffield/lazygit"
tap "schniz/tap"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Reimplementation of ctags(1)
brew "ctags"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Load/unload environment variables based on $PWD
brew "direnv"
# Docker Credential Helper for Amazon ECR
brew "docker-credential-helper-ecr"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern replacement for 'ls'
brew "exa"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Compare two HTTP(S) responses
brew "httpdiff"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Command-line interface for SQLite
brew "sqlite"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Curl statistics made simple
brew "httpstat"
# Add GitHub support to git on the command-line
brew "hub"
# Lightweight and flexible command-line JSON processor
brew "jq"
# LastPass command-line interface tool
brew "lastpass-cli"
# Asynchronous event library
brew "libevent"
# Generic library support script
brew "libtool"
# Multi-platform support library with a focus on asynchronous I/O
brew "libuv"
# C99 library which implements a VT220 or xterm terminal emulator
brew "libvterm"
# Text-based web browser
brew "lynx"
# Platform built on V8 to build network applications
brew "node"
# Wrap web apps natively
brew "nativefier"
# Text-based UI library
brew "ncurses"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Shell command parallelization utility
brew "parallel"
# Highly capable, feature-rich programming language
brew "perl"
# Python dependency management tool
brew "pipenv"
# Object-relational database system
brew "postgresql@10", restart_service: true, link: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.8"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Reattach process (e.g., tmux) to background
brew "reattach-to-user-namespace"
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Perl-powered file rename script with many helpful built-ins
brew "rename"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Rust toolchain installer
brew "rustup-init"
# Code-search similar to ack
brew "the_silver_searcher"
# Granddaddy of HTML tools, with support for modern standards
brew "tidy-html5"
# Text interface for Git repositories
brew "tig"
# Simplified and community-driven man pages
brew "tldr"
# Terminal multiplexer
brew "tmux", args: ["HEAD"]
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Watch files and take action when they change
brew "watchman"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Lefthook a single dependency-free binary to manage all your git hooks that works with any language in any environment, and in all common team workflows
brew "arkweid/lefthook/lefthook"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# Build runner for use with Buildkite
brew "buildkite/buildkite/buildkite-agent"
# A command line interface for Buildkite.
brew "buildkite/cli/bk"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
brew "itchyny/tap/mmv"
# A simple terminal UI for git commands, written in Go
brew "jesseduffield/lazygit/lazygit"
# Fast and simple Node.js version manager
brew "schniz/tap/fnm"
cask "font-anonymice-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-hack-nerd-font"
cask "font-iosevka-nerd-font"
cask "font-saucecodepro-nerd-font"
cask "graphiql"
cask "keycastr"
cask "kitty"
cask "neovim-nightly"
